#include<iostream>

//2.Имаме следната редица : 1, 3, 5, 14, 36, 91, 232, 591, 1505, 3833...
//Започваме с 1, 3 и 5. И всяко следващо число е 2 * предишното + попредишно + попопредишното.
//Напишете програма, която чрез рекурсия при подадено число n ни връща n - тото число в тази редица. (пример : вход : 10, изход : 3833)

int f(int n) {

	if (n == 1) return 1;
	if (n == 2) return 3;
	if (n == 3) return 5;

	return (2 * f(n - 1) + f(n - 2) + f(n - 3));
}

int main() {
	
	int n = 5;
	std::cout << f(n);

	return 0;
}